app/controllers/clientes_controller.rb

  def create
    @cliente = Cliente.new(cliente_params)
    flash[:notice] = 'Cliente was successfully created.' if @cliente.save
---
INSERT INTO "clientes" ("nombre", "telefono", "celular", "barrio", "direccion", "refdir", "hora", "ocacion", "valor", "fecha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    flash[:notice] = 'Cliente was successfully updated.' if @cliente.update(cliente_params)
---
UPDATE "clientes" SET "telefono" = ?, "valor" = ?, "fecha" = ?, "updated_at" = ? WHERE "clientes"."id" = ?  [["telefono", "telefono"], ["valor", 1], ["fecha", "2015-08-14"], ["updated_at", "2015-08-14 01:45:03.323112"], ["id", 1]]

  def destroy
    @cliente.destroy
---
DELETE FROM "clientes" WHERE "clientes"."id" = ?  [["id", 1]]